package U11_29;

public class Task1129 {

/*
 结合库存管理系统实现试下功能的GUI界面的操作
用Collection集合存储定义的对象，使用迭代器，增强for循环遍历集合。
编写一个程序，模拟库存管理系统，包括系统首页、商品入库功能，商品展示功能和删除商品功能：
提示：商品的信息包括商品名称、商品类别、商品价格，数据的显示使用JTable
（1） 系统首页：显示所有操作，可以选择其中一种操作。
（2） 商品入库：提示是否录入商品，根据用户输入信息判断是否录入，如果需要录入商品，需要用户输入商品名称、颜色、价格和数量信息。录入完成后，提示录入成功，并打印所有商品，不需要录入则返回系统首页。
（3） 展示商品功能：打印所有商品信息功能。
（4） 删除商品功能：用户选择删除商品功能后，根据用户输入的商品编号删除商品，打印删除后的所有商品
（5） 修改商品信息功能：用户输入商品的编号，可以对商品的基础信息进行修改，修改后打印商品的基础信息
 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}
}

